Number of non-trainable parameters: 2096
Number of trainable parameters:     399641
Number of total parameters:         401737
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, None, None, 4 0                                            
__________________________________________________________________________________________________
down_block_0_conv_0 (Conv2D)    (None, None, None, 1 444         input_1[0][0]                    
__________________________________________________________________________________________________
down_block_0_BN_0 (BatchNormali (None, None, None, 1 48          down_block_0_conv_0[0][0]        
__________________________________________________________________________________________________
down_block_0_conv_1 (Conv2D)    (None, None, None, 1 1308        down_block_0_BN_0[0][0]          
__________________________________________________________________________________________________
down_block_0_BN_1 (BatchNormali (None, None, None, 1 48          down_block_0_conv_1[0][0]        
__________________________________________________________________________________________________
down_block_0_maxp (MaxPooling2D (None, None, None, 1 0           down_block_0_BN_1[0][0]          
__________________________________________________________________________________________________
down_block_0_dropout (Dropout)  (None, None, None, 1 0           down_block_0_maxp[0][0]          
__________________________________________________________________________________________________
down_block_1_conv_0 (Conv2D)    (None, None, None, 2 2616        down_block_0_dropout[0][0]       
__________________________________________________________________________________________________
down_block_1_BN_0 (BatchNormali (None, None, None, 2 96          down_block_1_conv_0[0][0]        
__________________________________________________________________________________________________
down_block_1_conv_1 (Conv2D)    (None, None, None, 2 5208        down_block_1_BN_0[0][0]          
__________________________________________________________________________________________________
down_block_1_BN_1 (BatchNormali (None, None, None, 2 96          down_block_1_conv_1[0][0]        
__________________________________________________________________________________________________
down_block_1_maxp (MaxPooling2D (None, None, None, 2 0           down_block_1_BN_1[0][0]          
__________________________________________________________________________________________________
down_block_1_dropout (Dropout)  (None, None, None, 2 0           down_block_1_maxp[0][0]          
__________________________________________________________________________________________________
down_block_2_conv_0 (Conv2D)    (None, None, None, 3 7812        down_block_1_dropout[0][0]       
__________________________________________________________________________________________________
down_block_2_BN_0 (BatchNormali (None, None, None, 3 144         down_block_2_conv_0[0][0]        
__________________________________________________________________________________________________
down_block_2_conv_1 (Conv2D)    (None, None, None, 3 11700       down_block_2_BN_0[0][0]          
__________________________________________________________________________________________________
down_block_2_BN_1 (BatchNormali (None, None, None, 3 144         down_block_2_conv_1[0][0]        
__________________________________________________________________________________________________
down_block_2_maxp (MaxPooling2D (None, None, None, 3 0           down_block_2_BN_1[0][0]          
__________________________________________________________________________________________________
down_block_2_dropout (Dropout)  (None, None, None, 3 0           down_block_2_maxp[0][0]          
__________________________________________________________________________________________________
down_block_3_conv_0 (Conv2D)    (None, None, None, 4 15600       down_block_2_dropout[0][0]       
__________________________________________________________________________________________________
down_block_3_BN_0 (BatchNormali (None, None, None, 4 192         down_block_3_conv_0[0][0]        
__________________________________________________________________________________________________
down_block_3_conv_1 (Conv2D)    (None, None, None, 4 20784       down_block_3_BN_0[0][0]          
__________________________________________________________________________________________________
down_block_3_BN_1 (BatchNormali (None, None, None, 4 192         down_block_3_conv_1[0][0]        
__________________________________________________________________________________________________
down_block_3_maxp (MaxPooling2D (None, None, None, 4 0           down_block_3_BN_1[0][0]          
__________________________________________________________________________________________________
down_block_3_dropout (Dropout)  (None, None, None, 4 0           down_block_3_maxp[0][0]          
__________________________________________________________________________________________________
down_block_4_conv_0 (Conv2D)    (None, None, None, 6 27712       down_block_3_dropout[0][0]       
__________________________________________________________________________________________________
down_block_4_BN_0 (BatchNormali (None, None, None, 6 256         down_block_4_conv_0[0][0]        
__________________________________________________________________________________________________
down_block_4_conv_1 (Conv2D)    (None, None, None, 6 36928       down_block_4_BN_0[0][0]          
__________________________________________________________________________________________________
down_block_4_BN_1 (BatchNormali (None, None, None, 6 256         down_block_4_conv_1[0][0]        
__________________________________________________________________________________________________
down_block_4_maxp (MaxPooling2D (None, None, None, 6 0           down_block_4_BN_1[0][0]          
__________________________________________________________________________________________________
down_block_4_dropout (Dropout)  (None, None, None, 6 0           down_block_4_maxp[0][0]          
__________________________________________________________________________________________________
mini_maxp_conv1 (Conv2D)        (None, None, None, 6 36928       down_block_4_dropout[0][0]       
__________________________________________________________________________________________________
mini_maxp_BN1 (BatchNormalizati (None, None, None, 6 256         mini_maxp_conv1[0][0]            
__________________________________________________________________________________________________
mini_maxp_conv2 (Conv2D)        (None, None, None, 6 36928       mini_maxp_BN1[0][0]              
__________________________________________________________________________________________________
mini_maxp_BN2 (BatchNormalizati (None, None, None, 6 256         mini_maxp_conv2[0][0]            
__________________________________________________________________________________________________
mini_maxp_BN2_dropout (Dropout) (None, None, None, 6 0           mini_maxp_BN2[0][0]              
__________________________________________________________________________________________________
up_block_0_ConvT (Conv2DTranspo (None, None, None, 4 12336       mini_maxp_BN2_dropout[0][0]      
__________________________________________________________________________________________________
up_block_0_BN_0 (BatchNormaliza (None, None, None, 4 192         up_block_0_ConvT[0][0]           
__________________________________________________________________________________________________
up_block_0_conv_1 (Conv2D)      (None, None, None, 4 20784       up_block_0_BN_0[0][0]            
__________________________________________________________________________________________________
up_block_0_BN_1 (BatchNormaliza (None, None, None, 4 192         up_block_0_conv_1[0][0]          
__________________________________________________________________________________________________
up_block_0_conv_2 (Conv2D)      (None, None, None, 4 20784       up_block_0_BN_1[0][0]            
__________________________________________________________________________________________________
up_block_0_BN_2 (BatchNormaliza (None, None, None, 4 192         up_block_0_conv_2[0][0]          
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, None, 9 0           down_block_3_dropout[0][0]       
                                                                 up_block_0_BN_2[0][0]            
__________________________________________________________________________________________________
up_block_1_ConvT (Conv2DTranspo (None, None, None, 3 13860       concatenate_1[0][0]              
__________________________________________________________________________________________________
up_block_1_BN_0 (BatchNormaliza (None, None, None, 3 144         up_block_1_ConvT[0][0]           
__________________________________________________________________________________________________
up_block_1_conv_1 (Conv2D)      (None, None, None, 3 11700       up_block_1_BN_0[0][0]            
__________________________________________________________________________________________________
up_block_1_BN_1 (BatchNormaliza (None, None, None, 3 144         up_block_1_conv_1[0][0]          
__________________________________________________________________________________________________
up_block_1_conv_2 (Conv2D)      (None, None, None, 3 11700       up_block_1_BN_1[0][0]            
__________________________________________________________________________________________________
up_block_1_BN_2 (BatchNormaliza (None, None, None, 3 144         up_block_1_conv_2[0][0]          
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, None, None, 7 0           down_block_2_dropout[0][0]       
                                                                 up_block_1_BN_2[0][0]            
__________________________________________________________________________________________________
up_block_2_ConvT (Conv2DTranspo (None, None, None, 2 6936        concatenate_2[0][0]              
__________________________________________________________________________________________________
up_block_2_BN_0 (BatchNormaliza (None, None, None, 2 96          up_block_2_ConvT[0][0]           
__________________________________________________________________________________________________
up_block_2_conv_1 (Conv2D)      (None, None, None, 2 5208        up_block_2_BN_0[0][0]            
__________________________________________________________________________________________________
up_block_2_BN_1 (BatchNormaliza (None, None, None, 2 96          up_block_2_conv_1[0][0]          
__________________________________________________________________________________________________
up_block_2_conv_2 (Conv2D)      (None, None, None, 2 5208        up_block_2_BN_1[0][0]            
__________________________________________________________________________________________________
up_block_2_BN_2 (BatchNormaliza (None, None, None, 2 96          up_block_2_conv_2[0][0]          
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, None, None, 4 0           down_block_1_dropout[0][0]       
                                                                 up_block_2_BN_2[0][0]            
__________________________________________________________________________________________________
up_block_3_ConvT (Conv2DTranspo (None, None, None, 1 2316        concatenate_3[0][0]              
__________________________________________________________________________________________________
up_block_3_BN_0 (BatchNormaliza (None, None, None, 1 48          up_block_3_ConvT[0][0]           
__________________________________________________________________________________________________
up_block_3_conv_1 (Conv2D)      (None, None, None, 1 1308        up_block_3_BN_0[0][0]            
__________________________________________________________________________________________________
up_block_3_BN_1 (BatchNormaliza (None, None, None, 1 48          up_block_3_conv_1[0][0]          
__________________________________________________________________________________________________
up_block_3_conv_2 (Conv2D)      (None, None, None, 1 1308        up_block_3_BN_1[0][0]            
__________________________________________________________________________________________________
up_block_3_BN_2 (BatchNormaliza (None, None, None, 1 48          up_block_3_conv_2[0][0]          
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, None, None, 2 0           down_block_0_dropout[0][0]       
                                                                 up_block_3_BN_2[0][0]            
__________________________________________________________________________________________________
up_block_4_ConvT (Conv2DTranspo (None, None, None, 6 6208        concatenate_4[0][0]              
__________________________________________________________________________________________________
up_block_4_BN_0 (BatchNormaliza (None, None, None, 6 256         up_block_4_ConvT[0][0]           
__________________________________________________________________________________________________
up_block_4_conv_1 (Conv2D)      (None, None, None, 6 36928       up_block_4_BN_0[0][0]            
__________________________________________________________________________________________________
up_block_4_BN_1 (BatchNormaliza (None, None, None, 6 256         up_block_4_conv_1[0][0]          
__________________________________________________________________________________________________
up_block_4_conv_2 (Conv2D)      (None, None, None, 6 36928       up_block_4_BN_1[0][0]            
__________________________________________________________________________________________________
up_block_4_BN_2 (BatchNormaliza (None, None, None, 6 256         up_block_4_conv_2[0][0]          
__________________________________________________________________________________________________
output (Conv2D)                 (None, None, None, 1 65          up_block_4_BN_2[0][0]            
==================================================================================================
Total params: 401,737
Trainable params: 399,641
Non-trainable params: 2,096
__________________________________________________________________________________________________
